wk11/ReduxTodos/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        render json: Todo.find(params[:id])

SELECT "todos".* FROM "todos"
---
    def index
        render json: Todo.all